app/controllers/users_controller.rb

UPDATE "users" SET "contactno" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["contactno", "9725955155"], ["updated_at", "2021-04-07 11:10:00.989086"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)